[Timeout] ArithmeticOperator
src/components/Board/Board.tsx:45:20
     currentGameAction,
   }: FieldProps) => {
     const squareSize = 10;
-    const fieldW = width * squareSize;
+    const fieldW = width / squareSize;
     const fieldH = height * squareSize;
 

[Timeout] ArithmeticOperator
src/components/Board/Board.tsx:46:20
   }: FieldProps) => {
     const squareSize = 10;
     const fieldW = width * squareSize;
-    const fieldH = height * squareSize;
+    const fieldH = height / squareSize;
 
     const createInitialBoard = (): boolean[] => {

[Killed] BlockStatement
src/components/Board/Board.tsx:48:49
     const fieldW = width * squareSize;
     const fieldH = height * squareSize;
 
-    const createInitialBoard = (): boolean[] => {
-      return Array.from({ length: width * height }, () => false);
-    };
+    const createInitialBoard = (): boolean[] => {};
 
     const [board, setBoard] = useState<boolean[]>(createInitialBoard);
killedBy: Container renders Container component
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArithmeticOperator
src/components/Board/Board.tsx:49:35
     const fieldH = height * squareSize;
 
     const createInitialBoard = (): boolean[] => {
-      return Array.from({ length: width * height }, () => false);
+      return Array.from({ length: width / height }, () => false);
     };
 
killedBy: Container show number square
statusReason: Error: Unable to fire a "click" event - please provide a DOM element.

[Timeout] BooleanLiteral
src/components/Board/Board.tsx:49:59
     const fieldH = height * squareSize;
 
     const createInitialBoard = (): boolean[] => {
-      return Array.from({ length: width * height }, () => false);
+      return Array.from({ length: width * height }, () => true);
     };
 

[Timeout] BooleanLiteral
src/components/Board/Board.tsx:53:43
     };
 
     const [board, setBoard] = useState<boolean[]>(createInitialBoard);
-    const isFirstRender = useRef<boolean>(true);
+    const isFirstRender = useRef<boolean>(false);
     const [neighbours, setNeighbours] = useState<Neighbour[]>([]);
     const [intervalId, setIntervalId] = useState<NodeJS.Timer | number>(0);

[Timeout] ArrayDeclaration
src/components/Board/Board.tsx:54:63
 
     const [board, setBoard] = useState<boolean[]>(createInitialBoard);
     const isFirstRender = useRef<boolean>(true);
-    const [neighbours, setNeighbours] = useState<Neighbour[]>([]);
+    const [neighbours, setNeighbours] = useState<Neighbour[]>(["Stryker was here"]);
     const [intervalId, setIntervalId] = useState<NodeJS.Timer | number>(0);
     const [arraysHash, setArraysHash] = useState<number[]>([]);

[Timeout] ArrayDeclaration
src/components/Board/Board.tsx:56:60
     const isFirstRender = useRef<boolean>(true);
     const [neighbours, setNeighbours] = useState<Neighbour[]>([]);
     const [intervalId, setIntervalId] = useState<NodeJS.Timer | number>(0);
-    const [arraysHash, setArraysHash] = useState<number[]>([]);
+    const [arraysHash, setArraysHash] = useState<number[]>(["Stryker was here"]);
     useLayoutEffect(() => {
       setBoard(createInitialBoard);

[Killed] BlockStatement
src/components/Board/Board.tsx:57:27
     const [neighbours, setNeighbours] = useState<Neighbour[]>([]);
     const [intervalId, setIntervalId] = useState<NodeJS.Timer | number>(0);
     const [arraysHash, setArraysHash] = useState<number[]>([]);
-    useLayoutEffect(() => {
-      setBoard(createInitialBoard);
-      setNeighbours(() =>
-        calculationCoordinatesNeighboringSquares(width, height)
-      );
-    }, [width, height]);
+    useLayoutEffect(() => {}, [width, height]);
     useEffect(() => {
       if (isFirstRender.current) {
killedBy: Container correct draw board by 70x50 click
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3500
Received length: 1500

[Timeout] ArrowFunction
src/components/Board/Board.tsx:59:21
     const [arraysHash, setArraysHash] = useState<number[]>([]);
     useLayoutEffect(() => {
       setBoard(createInitialBoard);
-      setNeighbours(() =>
-        calculationCoordinatesNeighboringSquares(width, height)
+      setNeighbours(() => undefined
       );
     }, [width, height]);

[Timeout] ConditionalExpression
src/components/Board/Board.tsx:64:11
       );
     }, [width, height]);
     useEffect(() => {
-      if (isFirstRender.current) {
+      if (true) {
         isFirstRender.current = false;
         return;

[Timeout] BlockStatement
src/components/Board/Board.tsx:64:34
       );
     }, [width, height]);
     useEffect(() => {
-      if (isFirstRender.current) {
-        isFirstRender.current = false;
-        return;
-      }
+      if (isFirstRender.current) {}
       if (currentGameAction === "Run") {
         setArraysHash([hashcode(board)]);

[Timeout] BooleanLiteral
src/components/Board/Board.tsx:65:33
     }, [width, height]);
     useEffect(() => {
       if (isFirstRender.current) {
-        isFirstRender.current = false;
+        isFirstRender.current = true;
         return;
       }

[Killed] EqualityOperator
src/components/Board/Board.tsx:68:11
         isFirstRender.current = false;
         return;
       }
-      if (currentGameAction === "Run") {
+      if (currentGameAction !== "Run") {
         setArraysHash([hashcode(board)]);
         const interval = setInterval(() => {
killedBy: Board Run
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/components/Board/Board.tsx:68:11
         isFirstRender.current = false;
         return;
       }
-      if (currentGameAction === "Run") {
+      if (true) {
         setArraysHash([hashcode(board)]);
         const interval = setInterval(() => {
killedBy: Board Clear
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  square active

[Survived] ArrayDeclaration
src/components/Board/Board.tsx:69:23
         return;
       }
       if (currentGameAction === "Run") {
-        setArraysHash([hashcode(board)]);
+        setArraysHash([]);
         const interval = setInterval(() => {
           setBoard((prevBoard) => {

[NoCoverage] BlockStatement
src/components/Board/Board.tsx:70:44
       }
       if (currentGameAction === "Run") {
         setArraysHash([hashcode(board)]);
-        const interval = setInterval(() => {
-          setBoard((prevBoard) => {
-            let result: boolean[] = [];
-            result = generateNextBoard(prevBoard, neighbours);
-
-            if (result.every((square) => !square)) {
-              clearInterval(intervalId);
-              handleGameOver();
-              return result;
-            }
-
-            setArraysHash((prev) => {
-              const currentHash = hashcode(result);
-              if (prev.includes(currentHash)) {
-                clearInterval(intervalId);
-                handleGameOver();
-              }
-              return [...prev, currentHash];
-            });
-            return result;
-          });
-        }, 300);
+        const interval = setInterval(() => {}, 300);
         setIntervalId(interval);
         return;

[NoCoverage] BlockStatement
src/components/Board/Board.tsx:71:35
       if (currentGameAction === "Run") {
         setArraysHash([hashcode(board)]);
         const interval = setInterval(() => {
-          setBoard((prevBoard) => {
-            let result: boolean[] = [];
-            result = generateNextBoard(prevBoard, neighbours);
-
-            if (result.every((square) => !square)) {
-              clearInterval(intervalId);
-              handleGameOver();
-              return result;
-            }
-
-            setArraysHash((prev) => {
-              const currentHash = hashcode(result);
-              if (prev.includes(currentHash)) {
-                clearInterval(intervalId);
-                handleGameOver();
-              }
-              return [...prev, currentHash];
-            });
-            return result;
-          });
+          setBoard((prevBoard) => {});
         }, 300);
         setIntervalId(interval);

[NoCoverage] ConditionalExpression
src/components/Board/Board.tsx:75:17
             let result: boolean[] = [];
             result = generateNextBoard(prevBoard, neighbours);
 
-            if (result.every((square) => !square)) {
+            if (false) {
               clearInterval(intervalId);
               handleGameOver();

[NoCoverage] BooleanLiteral
src/components/Board/Board.tsx:75:42
             let result: boolean[] = [];
             result = generateNextBoard(prevBoard, neighbours);
 
-            if (result.every((square) => !square)) {
+            if (result.every((square) => square)) {
               clearInterval(intervalId);
               handleGameOver();

[NoCoverage] BlockStatement
src/components/Board/Board.tsx:81:37
               return result;
             }
 
-            setArraysHash((prev) => {
-              const currentHash = hashcode(result);
-              if (prev.includes(currentHash)) {
-                clearInterval(intervalId);
-                handleGameOver();
-              }
-              return [...prev, currentHash];
-            });
+            setArraysHash((prev) => {});
             return result;
           });

[NoCoverage] ConditionalExpression
src/components/Board/Board.tsx:83:19
 
             setArraysHash((prev) => {
               const currentHash = hashcode(result);
-              if (prev.includes(currentHash)) {
+              if (true) {
                 clearInterval(intervalId);
                 handleGameOver();

[NoCoverage] ConditionalExpression
src/components/Board/Board.tsx:83:19
 
             setArraysHash((prev) => {
               const currentHash = hashcode(result);
-              if (prev.includes(currentHash)) {
+              if (false) {
                 clearInterval(intervalId);
                 handleGameOver();

[Killed] ConditionalExpression
src/components/Board/Board.tsx:95:11
         setIntervalId(interval);
         return;
       }
-      if (currentGameAction === "Pause") {
+      if (true) {
         clearInterval(intervalId);
         setIntervalId(0);
killedBy: Board Clear
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  square active

[Killed] EqualityOperator
src/components/Board/Board.tsx:95:11
         setIntervalId(interval);
         return;
       }
-      if (currentGameAction === "Pause") {
+      if (currentGameAction !== "Pause") {
         clearInterval(intervalId);
         setIntervalId(0);
killedBy: Board Clear
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  square active

[Killed] EqualityOperator
src/components/Board/Board.tsx:100:11
         setIntervalId(0);
         return;
       }
-      if (currentGameAction === "Clear") {
+      if (currentGameAction !== "Clear") {
         clearInterval(intervalId);
         setBoard(createInitialBoard);
killedBy: Board Clear
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  square active

[Killed] ConditionalExpression
src/components/Board/Board.tsx:100:11
         setIntervalId(0);
         return;
       }
-      if (currentGameAction === "Clear") {
+      if (false) {
         clearInterval(intervalId);
         setBoard(createInitialBoard);
killedBy: Board Clear
statusReason: Error: expect(element).not.toHaveClass("active")

Expected the element not to have class:
  active
Received:
  square active

[Killed] BlockStatement
src/components/Board/Board.tsx:107:67
       }
     }, [currentGameAction]);
 
-    const handleClickSquare = (index: number, active: boolean) => {
-      getSquareNumber(index);
-      setBoard((prev) => {
-        prev[index] = active;
-        return [...prev];
-      });
-    };
+    const handleClickSquare = (index: number, active: boolean) => {};
 
     const drawFieldSquare = () => {
killedBy: Container show number square
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  9
Received:
  0

[Killed] BlockStatement
src/components/Board/Board.tsx:109:26
 
     const handleClickSquare = (index: number, active: boolean) => {
       getSquareNumber(index);
-      setBoard((prev) => {
-        prev[index] = active;
-        return [...prev];
-      });
+      setBoard((prev) => {});
     };
 
killedBy: Board Board run
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/components/Board/Board.tsx:115:35
       });
     };
 
-    const drawFieldSquare = () => {
-      const content: JSX.Element[] = [];
-      board.map((v, i) => {
-        content.push(
-          <Square
-            key={i}
-            number={i}
-            active={v}
-            changeActive={handleClickSquare}
-            currentGameAction={currentGameAction}
-          />
-        );
-      });
-      return content;
-    };
+    const drawFieldSquare = () => {};
     return (
       <div
killedBy: Board correct Board size
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 100
Received length: 0
Received object: []

[Killed] BlockStatement
src/components/Board/Board.tsx:117:27
 
     const drawFieldSquare = () => {
       const content: JSX.Element[] = [];
-      board.map((v, i) => {
-        content.push(
-          <Square
-            key={i}
-            number={i}
-            active={v}
-            changeActive={handleClickSquare}
-            currentGameAction={currentGameAction}
-          />
-        );
-      });
+      board.map((v, i) => {});
       return content;
     };
killedBy: Container show number square
statusReason: Error: Unable to fire a "click" event - please provide a DOM element.

[Timeout] BlockStatement
src/components/Board/Board.tsx:140:29
       </div>
     );
   },
-  (prevProps, nextProps) => {
-    return (
-      prevProps.currentGameAction === nextProps.currentGameAction &&
-      prevProps.width === nextProps.width &&
-      prevProps.height === nextProps.height
-    );
-  }
+  (prevProps, nextProps) => {}
 );
 Board.displayName = "Board";

[Killed] ConditionalExpression
src/components/Board/Board.tsx:142:7
   },
   (prevProps, nextProps) => {
     return (
-      prevProps.currentGameAction === nextProps.currentGameAction &&
-      prevProps.width === nextProps.width &&
-      prevProps.height === nextProps.height
+      true
     );
   }
killedBy: Board Run
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Timeout] EqualityOperator
src/components/Board/Board.tsx:142:7
   },
   (prevProps, nextProps) => {
     return (
-      prevProps.currentGameAction === nextProps.currentGameAction &&
+      prevProps.currentGameAction !== nextProps.currentGameAction &&
       prevProps.width === nextProps.width &&
       prevProps.height === nextProps.height

[Timeout] ConditionalExpression
src/components/Board/Board.tsx:143:7
   (prevProps, nextProps) => {
     return (
       prevProps.currentGameAction === nextProps.currentGameAction &&
-      prevProps.width === nextProps.width &&
+      true &&
       prevProps.height === nextProps.height
     );

[Timeout] EqualityOperator
src/components/Board/Board.tsx:143:7
   (prevProps, nextProps) => {
     return (
       prevProps.currentGameAction === nextProps.currentGameAction &&
-      prevProps.width === nextProps.width &&
+      prevProps.width !== nextProps.width &&
       prevProps.height === nextProps.height
     );

[Survived] EqualityOperator
src/components/Board/Board.tsx:144:7
     return (
       prevProps.currentGameAction === nextProps.currentGameAction &&
       prevProps.width === nextProps.width &&
-      prevProps.height === nextProps.height
+      prevProps.height !== nextProps.height
     );
   }

[Timeout] ConditionalExpression
src/components/Board/Board.tsx:144:7
     return (
       prevProps.currentGameAction === nextProps.currentGameAction &&
       prevProps.width === nextProps.width &&
-      prevProps.height === nextProps.height
+      true
     );
   }

[Survived] StringLiteral
src/components/Board/Board.tsx:148:21
     );
   }
 );
-Board.displayName = "Board";
+Board.displayName = "";
 export default Board;
 
