[Timeout] ArithmeticOperator
src/components/Board/helpers.ts:6:31
   width: number,
   height: number
 ): Neighbour[] => {
-  return Array.from({ length: width * height }).map<Neighbour>((v, i) => {
+  return Array.from({ length: width / height }).map<Neighbour>((v, i) => {
     let row = 1;
     if (i > 0) {

[Survived] BlockStatement
src/components/Board/helpers.ts:8:16
 ): Neighbour[] => {
   return Array.from({ length: width * height }).map<Neighbour>((v, i) => {
     let row = 1;
-    if (i > 0) {
-      row = Math.trunc(i / width) + 1;
-    }
+    if (i > 0) {}
     let column = 1;
     if (row === 1) {

[Survived] ConditionalExpression
src/components/Board/helpers.ts:8:9
 ): Neighbour[] => {
   return Array.from({ length: width * height }).map<Neighbour>((v, i) => {
     let row = 1;
-    if (i > 0) {
+    if (false) {
       row = Math.trunc(i / width) + 1;
     }

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:9:13
   return Array.from({ length: width * height }).map<Neighbour>((v, i) => {
     let row = 1;
     if (i > 0) {
-      row = Math.trunc(i / width) + 1;
+      row = Math.trunc(i / width) - 1;
     }
     let column = 1;

[Timeout] ArithmeticOperator
src/components/Board/helpers.ts:9:24
   return Array.from({ length: width * height }).map<Neighbour>((v, i) => {
     let row = 1;
     if (i > 0) {
-      row = Math.trunc(i / width) + 1;
+      row = Math.trunc(i * width) + 1;
     }
     let column = 1;

[Survived] BlockStatement
src/components/Board/helpers.ts:12:20
       row = Math.trunc(i / width) + 1;
     }
     let column = 1;
-    if (row === 1) {
-      column = i + 1;
-    } else {
+    if (row === 1) {} else {
       column = (i % width) + 1;
     }

[Survived] EqualityOperator
src/components/Board/helpers.ts:12:9
       row = Math.trunc(i / width) + 1;
     }
     let column = 1;
-    if (row === 1) {
+    if (row !== 1) {
       column = i + 1;
     } else {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:13:16
     }
     let column = 1;
     if (row === 1) {
-      column = i + 1;
+      column = i - 1;
     } else {
       column = (i % width) + 1;

[Timeout] BlockStatement
src/components/Board/helpers.ts:14:12
     let column = 1;
     if (row === 1) {
       column = i + 1;
-    } else {
-      column = (i % width) + 1;
-    }
+    } else {}
     return {
       topLeft: (function () {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:15:17
     if (row === 1) {
       column = i + 1;
     } else {
-      column = (i % width) + 1;
+      column = (i * width) + 1;
     }
     return {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:15:16
     if (row === 1) {
       column = i + 1;
     } else {
-      column = (i % width) + 1;
+      column = i % width - 1;
     }
     return {

[Survived] BlockStatement
src/components/Board/helpers.ts:18:29
       column = (i % width) + 1;
     }
     return {
-      topLeft: (function () {
-        if (column === 1 || row === 1) {
-          return null;
-        }
-        return i - width - 1;
-      })(),
+      topLeft: (function () {})(),
       top: (function () {
         if (row === 1) {

[Survived] ConditionalExpression
src/components/Board/helpers.ts:19:29
     }
     return {
       topLeft: (function () {
-        if (column === 1 || row === 1) {
+        if (column === 1 || false) {
           return null;
         }

[Survived] EqualityOperator
src/components/Board/helpers.ts:19:29
     }
     return {
       topLeft: (function () {
-        if (column === 1 || row === 1) {
+        if (column === 1 || row !== 1) {
           return null;
         }

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:22:16
         if (column === 1 || row === 1) {
           return null;
         }
-        return i - width - 1;
+        return i - width + 1;
       })(),
       top: (function () {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:22:16
         if (column === 1 || row === 1) {
           return null;
         }
-        return i - width - 1;
+        return i + width - 1;
       })(),
       top: (function () {

[Survived] BlockStatement
src/components/Board/helpers.ts:24:25
         }
         return i - width - 1;
       })(),
-      top: (function () {
-        if (row === 1) {
-          return null;
-        }
-        return i - width;
-      })(),
+      top: (function () {})(),
       topRight: (function () {
         if (row === 1 || column === width) {

[Survived] BlockStatement
src/components/Board/helpers.ts:25:24
         return i - width - 1;
       })(),
       top: (function () {
-        if (row === 1) {
-          return null;
-        }
+        if (row === 1) {}
         return i - width;
       })(),

[Survived] EqualityOperator
src/components/Board/helpers.ts:25:13
         return i - width - 1;
       })(),
       top: (function () {
-        if (row === 1) {
+        if (row !== 1) {
           return null;
         }

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:28:16
         if (row === 1) {
           return null;
         }
-        return i - width;
+        return i + width;
       })(),
       topRight: (function () {

[Survived] BlockStatement
src/components/Board/helpers.ts:30:30
         }
         return i - width;
       })(),
-      topRight: (function () {
-        if (row === 1 || column === width) {
-          return null;
-        }
-        return i - width + 1;
-      })(),
+      topRight: (function () {})(),
       left: (function () {
         if (column === 1) {

[Survived] ConditionalExpression
src/components/Board/helpers.ts:31:26
         return i - width;
       })(),
       topRight: (function () {
-        if (row === 1 || column === width) {
+        if (row === 1 || false) {
           return null;
         }

[Survived] BlockStatement
src/components/Board/helpers.ts:31:44
         return i - width;
       })(),
       topRight: (function () {
-        if (row === 1 || column === width) {
-          return null;
-        }
+        if (row === 1 || column === width) {}
         return i - width + 1;
       })(),

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:34:16
         if (row === 1 || column === width) {
           return null;
         }
-        return i - width + 1;
+        return i + width + 1;
       })(),
       left: (function () {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:34:16
         if (row === 1 || column === width) {
           return null;
         }
-        return i - width + 1;
+        return i - width - 1;
       })(),
       left: (function () {

[Survived] BlockStatement
src/components/Board/helpers.ts:36:26
         }
         return i - width + 1;
       })(),
-      left: (function () {
-        if (column === 1) {
-          return null;
-        }
-        return i - 1;
-      })(),
+      left: (function () {})(),
       right: (function () {
         if (column === width) {

[Timeout] ConditionalExpression
src/components/Board/helpers.ts:37:13
         return i - width + 1;
       })(),
       left: (function () {
-        if (column === 1) {
+        if (false) {
           return null;
         }

[Survived] ConditionalExpression
src/components/Board/helpers.ts:37:13
         return i - width + 1;
       })(),
       left: (function () {
-        if (column === 1) {
+        if (true) {
           return null;
         }

[Timeout] ArithmeticOperator
src/components/Board/helpers.ts:40:16
         if (column === 1) {
           return null;
         }
-        return i - 1;
+        return i + 1;
       })(),
       right: (function () {

[Timeout] BlockStatement
src/components/Board/helpers.ts:42:27
         }
         return i - 1;
       })(),
-      right: (function () {
-        if (column === width) {
-          return null;
-        }
-        return i + 1;
-      })(),
+      right: (function () {})(),
       bottomLeft: (function () {
         if (row === height || column === 1) {

[Timeout] ConditionalExpression
src/components/Board/helpers.ts:43:13
         return i - 1;
       })(),
       right: (function () {
-        if (column === width) {
+        if (true) {
           return null;
         }

[Survived] BlockStatement
src/components/Board/helpers.ts:43:31
         return i - 1;
       })(),
       right: (function () {
-        if (column === width) {
-          return null;
-        }
+        if (column === width) {}
         return i + 1;
       })(),

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:46:16
         if (column === width) {
           return null;
         }
-        return i + 1;
+        return i - 1;
       })(),
       bottomLeft: (function () {

[Survived] BlockStatement
src/components/Board/helpers.ts:48:32
         }
         return i + 1;
       })(),
-      bottomLeft: (function () {
-        if (row === height || column === 1) {
-          return null;
-        }
-        return i + width - 1;
-      })(),
+      bottomLeft: (function () {})(),
       bottom: (function () {
         if (row === height) {

[Survived] BlockStatement
src/components/Board/helpers.ts:49:45
         return i + 1;
       })(),
       bottomLeft: (function () {
-        if (row === height || column === 1) {
-          return null;
-        }
+        if (row === height || column === 1) {}
         return i + width - 1;
       })(),

[Survived] EqualityOperator
src/components/Board/helpers.ts:49:13
         return i + 1;
       })(),
       bottomLeft: (function () {
-        if (row === height || column === 1) {
+        if (row !== height || column === 1) {
           return null;
         }

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:52:16
         if (row === height || column === 1) {
           return null;
         }
-        return i + width - 1;
+        return i + width + 1;
       })(),
       bottom: (function () {

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:52:16
         if (row === height || column === 1) {
           return null;
         }
-        return i + width - 1;
+        return i - width - 1;
       })(),
       bottom: (function () {

[Survived] BlockStatement
src/components/Board/helpers.ts:54:28
         }
         return i + width - 1;
       })(),
-      bottom: (function () {
-        if (row === height) {
-          return null;
-        }
-        return i + width;
-      })(),
+      bottom: (function () {})(),
 
       bottomRight: (function () {

[Survived] ConditionalExpression
src/components/Board/helpers.ts:55:13
         return i + width - 1;
       })(),
       bottom: (function () {
-        if (row === height) {
+        if (false) {
           return null;
         }

[Survived] BlockStatement
src/components/Board/helpers.ts:55:29
         return i + width - 1;
       })(),
       bottom: (function () {
-        if (row === height) {
-          return null;
-        }
+        if (row === height) {}
         return i + width;
       })(),

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:58:16
         if (row === height) {
           return null;
         }
-        return i + width;
+        return i - width;
       })(),
 

[Survived] BlockStatement
src/components/Board/helpers.ts:61:33
         return i + width;
       })(),
 
-      bottomRight: (function () {
-        if (row === height || column === width) {
-          return null;
-        }
-        return i + width + 1;
-      })(),
+      bottomRight: (function () {})(),
     };
   });

[Survived] BlockStatement
src/components/Board/helpers.ts:62:49
       })(),
 
       bottomRight: (function () {
-        if (row === height || column === width) {
-          return null;
-        }
+        if (row === height || column === width) {}
         return i + width + 1;
       })(),

[Survived] ConditionalExpression
src/components/Board/helpers.ts:62:13
       })(),
 
       bottomRight: (function () {
-        if (row === height || column === width) {
+        if (true) {
           return null;
         }

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:65:16
         if (row === height || column === width) {
           return null;
         }
-        return i + width + 1;
+        return i + width - 1;
       })(),
     };

[Survived] ArithmeticOperator
src/components/Board/helpers.ts:65:16
         if (row === height || column === width) {
           return null;
         }
-        return i + width + 1;
+        return i - width + 1;
       })(),
     };

[Killed] BlockStatement
src/components/Board/helpers.ts:74:17
 export const generateNextBoard = (
   board: boolean[],
   neighbours: Neighbour[]
-): boolean[] => {
-  return board.map((v, i) => {
-    const neighbour: Neighbour = neighbours[i];
-    let countAliveSquare = 0;
-    for (const key in neighbour) {
-      const index: number | null = neighbour[key];
-      if (index && board[index]) {
-        countAliveSquare++;
-      }
-    }
-    // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
-    if (!v) {
-      return !v && countAliveSquare === 3;
-    }
-    return countAliveSquare === 3 || countAliveSquare === 2;
-  });
-};
+): boolean[] => {};
 export const hashcode = (arr: boolean[]) => {
   if (!Array.isArray(arr)) {
killedBy: Board algorithm generate next board
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [false, false, false, false, false, false, false, false, false, false, …]
Received: undefined

[Killed] BlockStatement
src/components/Board/helpers.ts:75:30
   board: boolean[],
   neighbours: Neighbour[]
 ): boolean[] => {
-  return board.map((v, i) => {
-    const neighbour: Neighbour = neighbours[i];
-    let countAliveSquare = 0;
-    for (const key in neighbour) {
-      const index: number | null = neighbour[key];
-      if (index && board[index]) {
-        countAliveSquare++;
-      }
-    }
-    // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
-    if (!v) {
-      return !v && countAliveSquare === 3;
-    }
-    return countAliveSquare === 3 || countAliveSquare === 2;
-  });
+  return board.map((v, i) => {});
 };
 export const hashcode = (arr: boolean[]) => {
killedBy: Board algorithm generate next board
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 100
+ Received  + 100

  Array [
-   false,
-   false,

[Survived] BlockStatement
src/components/Board/helpers.ts:78:34
   return board.map((v, i) => {
     const neighbour: Neighbour = neighbours[i];
     let countAliveSquare = 0;
-    for (const key in neighbour) {
-      const index: number | null = neighbour[key];
-      if (index && board[index]) {
-        countAliveSquare++;
-      }
-    }
+    for (const key in neighbour) {}
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
     if (!v) {

[Killed] LogicalOperator
src/components/Board/helpers.ts:80:11
     let countAliveSquare = 0;
     for (const key in neighbour) {
       const index: number | null = neighbour[key];
-      if (index && board[index]) {
+      if (index || board[index]) {
         countAliveSquare++;
       }
killedBy: Board algorithm generate next board
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -1,18 +1,16 @@
  Array [
-   false,

[NoCoverage] BlockStatement
src/components/Board/helpers.ts:80:34
     let countAliveSquare = 0;
     for (const key in neighbour) {
       const index: number | null = neighbour[key];
-      if (index && board[index]) {
-        countAliveSquare++;
-      }
+      if (index && board[index]) {}
     }
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)

[NoCoverage] UpdateOperator
src/components/Board/helpers.ts:81:9
     for (const key in neighbour) {
       const index: number | null = neighbour[key];
       if (index && board[index]) {
-        countAliveSquare++;
+        countAliveSquare--;
       }
     }

[Survived] ConditionalExpression
src/components/Board/helpers.ts:85:9
       }
     }
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
-    if (!v) {
+    if (false) {
       return !v && countAliveSquare === 3;
     }

[Survived] ConditionalExpression
src/components/Board/helpers.ts:85:9
       }
     }
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
-    if (!v) {
+    if (true) {
       return !v && countAliveSquare === 3;
     }

[Killed] ConditionalExpression
src/components/Board/helpers.ts:86:14
     }
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
     if (!v) {
-      return !v && countAliveSquare === 3;
+      return true;
     }
     return countAliveSquare === 3 || countAliveSquare === 2;
killedBy: Board algorithm generate next board
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 100
+ Received  + 100

  Array [
-   false,
-   false,

[Killed] EqualityOperator
src/components/Board/helpers.ts:86:20
     }
     // мёртвая клетка, чтобы оживить, нужно рядом найти 3 (не больше не меньше) живых клетки)
     if (!v) {
-      return !v && countAliveSquare === 3;
+      return !v && countAliveSquare !== 3;
     }
     return countAliveSquare === 3 || countAliveSquare === 2;
killedBy: Board algorithm generate next board
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 100
+ Received  + 100

  Array [
-   false,
-   false,

[NoCoverage] EqualityOperator
src/components/Board/helpers.ts:88:38
     if (!v) {
       return !v && countAliveSquare === 3;
     }
-    return countAliveSquare === 3 || countAliveSquare === 2;
+    return countAliveSquare === 3 || countAliveSquare !== 2;
   });
 };

[NoCoverage] ConditionalExpression
src/components/Board/helpers.ts:88:12
     if (!v) {
       return !v && countAliveSquare === 3;
     }
-    return countAliveSquare === 3 || countAliveSquare === 2;
+    return false;
   });
 };

[Killed] BlockStatement
src/components/Board/helpers.ts:91:45
     return countAliveSquare === 3 || countAliveSquare === 2;
   });
 };
-export const hashcode = (arr: boolean[]) => {
-  if (!Array.isArray(arr)) {
-    throw new TypeError("Arr is not array");
-  }
-  let hash = 0;
-  for (let i = 0; i < arr.length; i++) {
-    hash = (hash << 5) - hash + Number(arr[i]);
-    hash |= 0;
-  }
-  return hash;
-};
+export const hashcode = (arr: boolean[]) => {};
 
killedBy: Board hashcode input parameter is array
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Arr is not array"

Received function did not throw

[Killed] BooleanLiteral
src/components/Board/helpers.ts:92:7
   });
 };
 export const hashcode = (arr: boolean[]) => {
-  if (!Array.isArray(arr)) {
+  if (Array.isArray(arr)) {
     throw new TypeError("Arr is not array");
   }
killedBy: Board Board run
statusReason: TypeError: Arr is not array

[Killed] ConditionalExpression
src/components/Board/helpers.ts:92:7
   });
 };
 export const hashcode = (arr: boolean[]) => {
-  if (!Array.isArray(arr)) {
+  if (false) {
     throw new TypeError("Arr is not array");
   }
killedBy: Board hashcode input parameter is array
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Arr is not array"

Received function did not throw

[Timeout] EqualityOperator
src/components/Board/helpers.ts:96:19
     throw new TypeError("Arr is not array");
   }
   let hash = 0;
-  for (let i = 0; i < arr.length; i++) {
+  for (let i = 0; i <= arr.length; i++) {
     hash = (hash << 5) - hash + Number(arr[i]);
     hash |= 0;

[Timeout] BlockStatement
src/components/Board/helpers.ts:96:40
     throw new TypeError("Arr is not array");
   }
   let hash = 0;
-  for (let i = 0; i < arr.length; i++) {
-    hash = (hash << 5) - hash + Number(arr[i]);
-    hash |= 0;
-  }
+  for (let i = 0; i < arr.length; i++) {}
   return hash;
 };

[Killed] ArithmeticOperator
src/components/Board/helpers.ts:97:12
   }
   let hash = 0;
   for (let i = 0; i < arr.length; i++) {
-    hash = (hash << 5) - hash + Number(arr[i]);
+    hash = (hash << 5) + hash + Number(arr[i]);
     hash |= 0;
   }
killedBy: Board hashcode return correct value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 31
Received: 33

[Killed] ArithmeticOperator
src/components/Board/helpers.ts:97:12
   }
   let hash = 0;
   for (let i = 0; i < arr.length; i++) {
-    hash = (hash << 5) - hash + Number(arr[i]);
+    hash = (hash << 5) - hash - Number(arr[i]);
     hash |= 0;
   }
killedBy: Board hashcode return correct value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 31
Received: -31

[Killed] AssignmentOperator
src/components/Board/helpers.ts:98:5
   let hash = 0;
   for (let i = 0; i < arr.length; i++) {
     hash = (hash << 5) - hash + Number(arr[i]);
-    hash |= 0;
+    hash &= 0;
   }
   return hash;
killedBy: Board hashcode return correct value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 31
Received: 0
