[Killed] ArrayDeclaration
src/components/Container/Container.tsx:14:42
 type sizeButtonsType = boardSizeType & { name: string };
 export type eventButtonsType = "Run" | "Pause" | "Clear" | "End";
 export const Container = () => {
-  const sizeButtons: sizeButtonsType[] = [
-    {
-      width: 50,
-      height: 30,
-      name: "50x30",
-    },
-    {
-      width: 70,
-      height: 50,
-      name: "70x50",
-    },
-    {
-      width: 100,
-      height: 80,
-      name: "100x80",
-    },
-  ];
+  const sizeButtons: sizeButtonsType[] = [];
   const [boardSize, setBoardSize] = useState<boardSizeType>({
     width: 50,
killedBy: Container correct draw board by 50x30 click
statusReason: TestingLibraryElementError: Unable to find an element with the text: 50x30. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
      data-testid="container-element"

[Killed] ObjectLiteral
src/components/Container/Container.tsx:20:5
       height: 30,
       name: "50x30",
     },
-    {
-      width: 70,
-      height: 50,
-      name: "70x50",
-    },
+    {},
     {
       width: 100,
killedBy: Container correct draw board by 70x50 click
statusReason: TestingLibraryElementError: Unable to find an element with the text: 70x50. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
      data-testid="container-element"

[Killed] StringLiteral
src/components/Container/Container.tsx:40:22
   const [activeSizeButton, setActiveSizeButton] =
     useState<sizeButtonsType["name"]>("50x30");
   const [activeActionsButton, setActiveActionsButton] =
-    useState<string>("Pause");
+    useState<string>("");
   const handleSetBoardSize = (
     event: React.SyntheticEvent<HTMLButtonElement>
killedBy: Container Container Pause
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  gol-btn

[Killed] BlockStatement
src/components/Container/Container.tsx:43:8
     useState<string>("Pause");
   const handleSetBoardSize = (
     event: React.SyntheticEvent<HTMLButtonElement>
-  ) => {
-    if (!(event.target instanceof HTMLButtonElement)) {
-      return;
-    }
-    setBoardSize({
-      width: Number(event.target.dataset.width),
-      height: Number(event.target.dataset.height),
-    });
-    setActiveSizeButton(event.target.name);
-  };
+  ) => {};
   const handleClear = (event: React.SyntheticEvent<HTMLButtonElement>) => {
     if (currentGameAction === "Clear") {
killedBy: Container correct draw board by 70x50 click
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3500
Received length: 1500

[Killed] ConditionalExpression
src/components/Container/Container.tsx:44:9
   const handleSetBoardSize = (
     event: React.SyntheticEvent<HTMLButtonElement>
   ) => {
-    if (!(event.target instanceof HTMLButtonElement)) {
+    if (true) {
       return;
     }
killedBy: Container correct draw board by 70x50 click
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3500
Received length: 1500

[Killed] BooleanLiteral
src/components/Container/Container.tsx:44:9
   const handleSetBoardSize = (
     event: React.SyntheticEvent<HTMLButtonElement>
   ) => {
-    if (!(event.target instanceof HTMLButtonElement)) {
+    if (event.target instanceof HTMLButtonElement) {
       return;
     }
killedBy: Container correct draw board by 70x50 click
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3500
Received length: 1500

[Killed] BlockStatement
src/components/Container/Container.tsx:53:75
     });
     setActiveSizeButton(event.target.name);
   };
-  const handleClear = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Clear") {
-      return;
-    }
-    setInfoField("Clear");
-    setCurrentGameAction("Clear");
-    setActiveActionsButton((event.target as HTMLButtonElement).name);
-  };
+  const handleClear = (event: React.SyntheticEvent<HTMLButtonElement>) => {};
   const handleRun = (event: React.SyntheticEvent<HTMLButtonElement>) => {
     if (currentGameAction === "Run") {
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Clear/
Received:
  0

[Killed] ConditionalExpression
src/components/Container/Container.tsx:54:9
     setActiveSizeButton(event.target.name);
   };
   const handleClear = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Clear") {
+    if (true) {
       return;
     }
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Clear/
Received:
  0

[Killed] EqualityOperator
src/components/Container/Container.tsx:54:9
     setActiveSizeButton(event.target.name);
   };
   const handleClear = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Clear") {
+    if (currentGameAction !== "Clear") {
       return;
     }
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Clear/
Received:
  0

[Killed] StringLiteral
src/components/Container/Container.tsx:57:18
     if (currentGameAction === "Clear") {
       return;
     }
-    setInfoField("Clear");
+    setInfoField("");
     setCurrentGameAction("Clear");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Clear/
Received:

[Killed] BlockStatement
src/components/Container/Container.tsx:61:73
     setCurrentGameAction("Clear");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };
-  const handleRun = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Run") {
-      return;
-    }
-    setInfoField("Running...");
-    setCurrentGameAction("Run");
-    setActiveActionsButton((event.target as HTMLButtonElement).name);
-  };
+  const handleRun = (event: React.SyntheticEvent<HTMLButtonElement>) => {};
 
   const handlePause = (event: React.SyntheticEvent<HTMLButtonElement>) => {
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Running/
Received:
  0

[Killed] EqualityOperator
src/components/Container/Container.tsx:62:9
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };
   const handleRun = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Run") {
+    if (currentGameAction !== "Run") {
       return;
     }
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Running/
Received:
  0

[Killed] ConditionalExpression
src/components/Container/Container.tsx:62:9
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };
   const handleRun = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Run") {
+    if (true) {
       return;
     }
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Running/
Received:
  0

[Killed] StringLiteral
src/components/Container/Container.tsx:65:18
     if (currentGameAction === "Run") {
       return;
     }
-    setInfoField("Running...");
+    setInfoField("");
     setCurrentGameAction("Run");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Running/
Received:

[Survived] StringLiteral
src/components/Container/Container.tsx:66:26
       return;
     }
     setInfoField("Running...");
-    setCurrentGameAction("Run");
+    setCurrentGameAction("");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };

[Killed] BlockStatement
src/components/Container/Container.tsx:70:75
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };
 
-  const handlePause = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Pause") {
-      return;
-    }
-    setInfoField("Pause");
-    setCurrentGameAction("Pause");
-    setActiveActionsButton((event.target as HTMLButtonElement).name);
-  };
+  const handlePause = (event: React.SyntheticEvent<HTMLButtonElement>) => {};
 
   const handleGameOver = (): void => {
killedBy: Container Container Pause
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Pause/
Received:
  Clear

[Killed] ConditionalExpression
src/components/Container/Container.tsx:71:9
   };
 
   const handlePause = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Pause") {
+    if (true) {
       return;
     }
killedBy: Container Container Pause
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Pause/
Received:
  Clear

[Killed] EqualityOperator
src/components/Container/Container.tsx:71:9
   };
 
   const handlePause = (event: React.SyntheticEvent<HTMLButtonElement>) => {
-    if (currentGameAction === "Pause") {
+    if (currentGameAction !== "Pause") {
       return;
     }
killedBy: Container Container Pause
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Pause/
Received:
  Clear

[Killed] StringLiteral
src/components/Container/Container.tsx:74:18
     if (currentGameAction === "Pause") {
       return;
     }
-    setInfoField("Pause");
+    setInfoField("");
     setCurrentGameAction("Pause");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
killedBy: Container Container Pause
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /Pause/
Received:

[Survived] StringLiteral
src/components/Container/Container.tsx:75:26
       return;
     }
     setInfoField("Pause");
-    setCurrentGameAction("Pause");
+    setCurrentGameAction("");
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };

[NoCoverage] BlockStatement
src/components/Container/Container.tsx:79:38
     setActiveActionsButton((event.target as HTMLButtonElement).name);
   };
 
-  const handleGameOver = (): void => {
-    setCurrentGameAction("Pause");
-    setActiveActionsButton("Pause");
-    setInfoField("Game Over :(");
-  };
+  const handleGameOver = (): void => {};
 
   const [infoField, setInfoField] = useState<string | number>(0);

[NoCoverage] StringLiteral
src/components/Container/Container.tsx:82:18
   const handleGameOver = (): void => {
     setCurrentGameAction("Pause");
     setActiveActionsButton("Pause");
-    setInfoField("Game Over :(");
+    setInfoField("");
   };
 

[Killed] BlockStatement
src/components/Container/Container.tsx:90:38
   return (
     <div className={s.container} data-testid="container-element">
       <div className={`${s["set-board-size"]} ${global_s.mb}`}>
-        {sizeButtons.map((button) => {
-          return (
-            <Button
-              className={button.name === activeSizeButton ? "active" : ""}
-              name={button.name}
-              onClick={handleSetBoardSize}
-              data-width={button.width}
-              data-height={button.height}
-              key={button.name}
-            >
-              {button.name}
-            </Button>
-          );
-        })}
+        {sizeButtons.map((button) => {})}
       </div>
       <div className={`${s["board-actions"]} ${global_s.mb}`}>
killedBy: Container correct draw board by 50x30 click
statusReason: TestingLibraryElementError: Unable to find an element with the text: 50x30. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
      data-testid="container-element"

[Survived] ConditionalExpression
src/components/Container/Container.tsx:93:26
         {sizeButtons.map((button) => {
           return (
             <Button
-              className={button.name === activeSizeButton ? "active" : ""}
+              className={true ? "active" : ""}
               name={button.name}
               onClick={handleSetBoardSize}

[Survived] EqualityOperator
src/components/Container/Container.tsx:93:26
         {sizeButtons.map((button) => {
           return (
             <Button
-              className={button.name === activeSizeButton ? "active" : ""}
+              className={button.name !== activeSizeButton ? "active" : ""}
               name={button.name}
               onClick={handleSetBoardSize}

[Survived] StringLiteral
src/components/Container/Container.tsx:105:28
           );
         })}
       </div>
-      <div className={`${s["board-actions"]} ${global_s.mb}`}>
+      <div className={`${s[""]} ${global_s.mb}`}>
         <Button
           onClick={handleRun}

[Killed] EqualityOperator
src/components/Container/Container.tsx:109:22
         <Button
           onClick={handleRun}
           name="Run"
-          className={"Run" === activeActionsButton ? "active" : ""}
+          className={"Run" !== activeActionsButton ? "active" : ""}
           data-testid="btn-run"
         >
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  gol-btn

[Killed] ConditionalExpression
src/components/Container/Container.tsx:109:22
         <Button
           onClick={handleRun}
           name="Run"
-          className={"Run" === activeActionsButton ? "active" : ""}
+          className={false ? "active" : ""}
           data-testid="btn-run"
         >
killedBy: Container Container Run
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  gol-btn

[Timeout] EqualityOperator
src/components/Container/Container.tsx:117:22
         <Button
           onClick={handlePause}
           name="Pause"
-          className={"Pause" === activeActionsButton ? "active" : ""}
+          className={"Pause" !== activeActionsButton ? "active" : ""}
           data-testid="btn-pause"
         >

[Timeout] ConditionalExpression
src/components/Container/Container.tsx:117:22
         <Button
           onClick={handlePause}
           name="Pause"
-          className={"Pause" === activeActionsButton ? "active" : ""}
+          className={true ? "active" : ""}
           data-testid="btn-pause"
         >

[Killed] EqualityOperator
src/components/Container/Container.tsx:125:22
         <Button
           onClick={handleClear}
           name="Clear"
-          className={"Clear" === activeActionsButton ? "active" : ""}
+          className={"Clear" !== activeActionsButton ? "active" : ""}
           data-testid="btn-clear"
         >
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  gol-btn

[Timeout] ConditionalExpression
src/components/Container/Container.tsx:125:22
         <Button
           onClick={handleClear}
           name="Clear"
-          className={"Clear" === activeActionsButton ? "active" : ""}
+          className={false ? "active" : ""}
           data-testid="btn-clear"
         >

[Survived] StringLiteral
src/components/Container/Container.tsx:133:25
       </div>
       <br />
       <div
-        style={{ color: "white", fontSize: 24 }}
+        style={{ color: "", fontSize: 24 }}
         data-testid="numberfield-element"
       >

[Survived] ObjectLiteral
src/components/Container/Container.tsx:133:16
       </div>
       <br />
       <div
-        style={{ color: "white", fontSize: 24 }}
+        style={{}}
         data-testid="numberfield-element"
       >
