[Killed] BlockStatement
src/components/Square/Square.tsx:14:60
 // eslint-disable-next-line react/display-name
 export const Square: FunctionComponent<squareProps> = memo(
   // eslint-disable-next-line react/prop-types
-  ({ number, changeActive, active, currentGameAction }) => {
-    const handleClick = () => {
-      if (currentGameAction === "Run") {
-        return;
-      }
-
-      changeActive(number, !active);
-    };
-
-    const activeClass = active ? s.active : "";
-
-    return (
-      <span
-        data-testid="square-element"
-        className={`${s.square} ${activeClass}`}
-        onClick={handleClick}
-      ></span>
-    );
-  },
+  ({ number, changeActive, active, currentGameAction }) => {},
   (prevProps, nextProps) => {
     return (
killedBy: Board correct Board size
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 100
Received length: 0
Received object: []

[Killed] BlockStatement
src/components/Square/Square.tsx:15:31
 export const Square: FunctionComponent<squareProps> = memo(
   // eslint-disable-next-line react/prop-types
   ({ number, changeActive, active, currentGameAction }) => {
-    const handleClick = () => {
-      if (currentGameAction === "Run") {
-        return;
-      }
-
-      changeActive(number, !active);
-    };
+    const handleClick = () => {};
 
     const activeClass = active ? s.active : "";
killedBy: Container show number square
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  9
Received:
  0

[Killed] ConditionalExpression
src/components/Square/Square.tsx:16:11
   // eslint-disable-next-line react/prop-types
   ({ number, changeActive, active, currentGameAction }) => {
     const handleClick = () => {
-      if (currentGameAction === "Run") {
+      if (true) {
         return;
       }
killedBy: Container show number square
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  9
Received:
  0

[Killed] EqualityOperator
src/components/Square/Square.tsx:16:11
   // eslint-disable-next-line react/prop-types
   ({ number, changeActive, active, currentGameAction }) => {
     const handleClick = () => {
-      if (currentGameAction === "Run") {
+      if (currentGameAction !== "Run") {
         return;
       }
killedBy: Container show number square
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  9
Received:
  0

[Killed] BooleanLiteral
src/components/Square/Square.tsx:20:28
         return;
       }
 
-      changeActive(number, !active);
+      changeActive(number, active);
     };
 
killedBy: Board Board run
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  square

[Survived] BlockStatement
src/components/Square/Square.tsx:33:29
       ></span>
     );
   },
-  (prevProps, nextProps) => {
-    return (
-      prevProps.active === nextProps.active &&
-      prevProps.currentGameAction === nextProps.currentGameAction
-    );
-  }
+  (prevProps, nextProps) => {}
 );
 

[Killed] LogicalOperator
src/components/Square/Square.tsx:35:7
   },
   (prevProps, nextProps) => {
     return (
-      prevProps.active === nextProps.active &&
-      prevProps.currentGameAction === nextProps.currentGameAction
+      prevProps.active === nextProps.active || prevProps.currentGameAction === nextProps.currentGameAction
     );
   }
killedBy: Board Board run
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  square

[Killed] EqualityOperator
src/components/Square/Square.tsx:35:7
   },
   (prevProps, nextProps) => {
     return (
-      prevProps.active === nextProps.active &&
+      prevProps.active !== nextProps.active &&
       prevProps.currentGameAction === nextProps.currentGameAction
     );
killedBy: Board Board run
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  square

[Survived] ConditionalExpression
src/components/Square/Square.tsx:36:7
   (prevProps, nextProps) => {
     return (
       prevProps.active === nextProps.active &&
-      prevProps.currentGameAction === nextProps.currentGameAction
+      true
     );
   }

[Survived] EqualityOperator
src/components/Square/Square.tsx:36:7
   (prevProps, nextProps) => {
     return (
       prevProps.active === nextProps.active &&
-      prevProps.currentGameAction === nextProps.currentGameAction
+      prevProps.currentGameAction !== nextProps.currentGameAction
     );
   }
