[Killed] BlockStatement
src/components/Button/Button.tsx:10:7
   onClick,
   className = "",
   ...props
-}) => {
-  const preparedClassNames = `${s["gol-btn"]} ${className
-    .split(" ")
-    .map((name) => s[name])}`;
-  return (
-    <button
-      data-testid="button-element"
-      type={type}
-      className={preparedClassNames}
-      onClick={onClick}
-      {...props}
-    >
-      {children}
-    </button>
-  );
-};
+}) => {};
 
killedBy: Container correct draw board by 50x30 click
statusReason: TestingLibraryElementError: Unable to find an element with the text: 50x30. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
      data-testid="container-element"

[Survived] StringLiteral
src/components/Button/Button.tsx:11:35
   className = "",
   ...props
 }) => {
-  const preparedClassNames = `${s["gol-btn"]} ${className
+  const preparedClassNames = `${s[""]} ${className
     .split(" ")
     .map((name) => s[name])}`;

[Killed] ArrowFunction
src/components/Button/Button.tsx:13:10
 }) => {
   const preparedClassNames = `${s["gol-btn"]} ${className
     .split(" ")
-    .map((name) => s[name])}`;
+    .map(() => undefined)}`;
   return (
     <button
killedBy: Container Container Clear
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  gol-btn
